diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование актов...";
	Оповещение = Новый ОписаниеОповещения("ОперацияВФонеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);  
	
	
  			
КонецПроцедуры

&НаСервере 
Функция СоздатьАктыНаСервере()
	
	НаименованиеЗадания = НСтр("ru = 'Формирование актов'");
	ИмяФункции = "Обработки.ВКМ_МассовоеСозданиеАктов.СозданныеАкты";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ИмяФункции;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяФункции,ПараметрыПроцедуры);
		
КонецФункции 

 &НаКлиенте
Процедура ОперацияВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Если Результат.Статус = "Выполнено" Тогда
		ДлительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Формирование документов реализации выполнено успешно");
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Статус операции: ошибка выпонения, обратитесь с системному администратору");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 
Процедура ДлительныеОперацииЗавершениеНаСервере(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	СсылкаНаДокумент = Результат;
 
	Объект.СписокРеализаций.Очистить();
	
    Для Каждого Строка Из СсылкаНаДокумент Цикл
	НоваяСтрока = Объект.СписокРеализаций.Добавить();
	НоваяСтрока.Договор = Строка.Договор;
	НоваяСтрока.Ссылка = Строка.Ссылка;
	КонецЦикла; 
	
КонецПроцедуры
